{
  "ROKU, INC.": {
    "2020": {
      "2020": {
        "FORM": "8-K",
        "CATEGORIES": {
          "Section 5 - Corporate Governance and Management": {
            "ITEMS": {
              "Item 5.02 - Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers": {
                "content": "On December 3, 2020, Laurie Simon Hodrick, Ph.D. and Gina A. Luna were appointed to the board of directors of Roku, Inc.",
                "subsections": {
                  "Director Terms and Committee Appointments": "Ms. Hodrick was appointed to serve as a Class I director whose term will expire at our 2021 annual meeting of stockholders. Ms. Luna was appointed to serve as a Class II director whose term will expire at our 2022 annual meeting of stockholders. There is no arrangement or understanding between Ms. Hodrick or Ms. Luna and us, or any other person, pursuant to which they were appointed as directors. Ms. Hodrick and Ms. Luna have also been appointed to the audit committee of the board of directors.",
                  "Compensation and Equity Awards": "In accordance with our Non-Employee Director Compensation Policy, as amended from time to time, Ms. Hodrick and Ms. Luna will each receive an annual cash retainer of $45,000 for serving on the board of directors and an annual cash retainer of $10,000 for serving on the audit committee, both paid quarterly. Ms. Hodrick and Ms. Luna were each granted pursuant to our 2017 Equity Incentive Plan: (1) a stock option to purchase 780 shares of Class A common stock with an exercise price of $289.10 per share, the closing price of our Class A common stock as reported on the Nasdaq Global Select Stock Market on December 3, 2020, which will vest in six equal monthly amounts, and (2) a restricted stock unit for 269 shares of Class A common stock, which will vest in full on the date of our 2021 annual meeting of stockholders. These equity awards have an aggregate annualized grant date value of $225,000, pro-rated on a monthly basis for the period commencing on December 3, 2020 and ending on the expected date of our 2021 annual meeting of stockholders. In the event of a change in control of Roku, all of Ms. Hodrick’s and Ms. Luna’s respective unvested equity awards will vest immediately prior to the consummation of such change in control.",
                  "Indemnification Agreement": "Each of Ms. Hodrick and Ms. Luna will enter into our standard form of indemnification agreement, which is attached as Exhibit 10.9 to our Amendment No. 1 to the Registration Statement on Form S-1 filed with the Securities and Exchange Commission on September 18, 2017 (File No. 333-220318)."
                }
              }
            }
          }
        }
      }
    },
    "2021": {
      "2021": {
        "FORM": "8-K",
        "CATEGORIES": {
          "Section 2 - Financial Information": {
            "ITEMS": {
              "Item 2.02 - Results of Operations and Financial Condition": {
                "content": "On November 3, 2021, Roku, Inc. (the “Company”) announced its financial results for the quarter ended September 30, 2021. The Company’s Shareholder Letter, which is attached hereto as Exhibit 99.1, is incorporated herein by reference.",
                "subsections": {
                  "filing_status": "The information in this report shall not be treated as “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, nor shall it be deemed incorporated by reference into any registration statement or other document pursuant to the Securities Act of 1933 or the Securities Exchange Act of 1934, except as expressly stated by specific reference in such filing."
                }
              }
            }
          },
          "Section 9 - Financial Statements and Exhibits": {
            "ITEMS": {
              "Item 9.01 - Financial Statements and Exhibits": {
                "content": "(d) Exhibits.",
                "subsections": {
                  "exhibits_list": "Exhibit Number 99.1*: Shareholder Letter dated November 3, 2021. *This exhibit is intended to be furnished and shall not be deemed “filed” for purposes of the Securities and Exchange Act of 1934.\nExhibit Number 104: Cover Page Interactive Data File (embedded within the Inline XBRL document)."
                }
              }
            }
          }
        }
      }
    },
    "2022": {
      "2022": {
        "FORM": "8-K",
        "CATEGORIES": {
          "Section 5 - Corporate Governance and Management": {
            "ITEMS": {
              "Item 5.02 - Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers": {
                "content": "On December 13, 2022, Roku, Inc. (the “Company”) appointed Matthew Banks as the Company’s Vice President, Corporate Controller and Chief Accounting Officer. In his new role, Mr. Banks will serve as the Company’s principal accounting officer. The Company’s Chief Financial Officer, Steve Louden, who previously served as both principal financial officer and principal accounting officer, will continue serving as the Company’s principal financial officer.",
                "subsections": {
                  "ExecutiveBiography": "Mr. Banks, age 45, joined the Company in February 2021 as Vice President, Corporate Controller. From September 2018 to August 2020, Mr. Banks served as Vice President, Controller of InVision Inc. From January 2012 to September 2018, Mr. Banks held senior roles at Meta Platforms, Inc. (formerly known as Facebook, Inc.), including Corporate Controller and Director, Revenue Accounting and Operations. Prior to 2012, Mr. Banks held senior roles at Yahoo! Inc. and Ernst & Young LLP. Mr. Banks holds a B.A. in Business Economics from the University of California, Santa Barbara and is a Certified Public Accountant (inactive) in California.",
                  "CompensatoryArrangements": "In connection with his appointment, Mr. Banks will receive (i) an annual base salary of $1,200,000 and (ii) a market adjustment equity award with a value of $1,120,000 vesting over four years and a retention equity award with a value of $1,500,000 vesting over two years, each of which will be granted pursuant to the terms of the Company’s 2017 Equity Incentive Plan. Mr. Banks is a participant in the Company’s Amended and Restated Severance Benefit Plan, which is attached as Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the Securities and Exchange Commission (“SEC”) on September 14, 2022 (File No. 001-38211) and is eligible to participate in the Company’s other employee benefits as may be offered from time to time. Mr. Banks will enter into the Company’s standard form of indemnification agreement, which is attached as Exhibit 10.9 to the Company’s Amendment No. 1 to the Registration Statement on Form S-1 filed with the SEC on September 18, 2017 (File No. 333-220318)."
                }
              }
            }
          }
        }
      }
    },
    "2023": {
      "2023": {
        "FORM": "8-K",
        "CATEGORIES": {
          "Section 2 - Financial Information": {
            "ITEMS": {
              "Item 2.02 - Results of Operations and Financial Condition": {
                "content": "On November 1, 2023, Roku, Inc. (the “Company”) announced its financial results for the quarter ended September 30, 2023. The Company’s Shareholder Letter, which is attached hereto as Exhibit 99.1, is incorporated herein by reference. The information in this report shall not be treated as “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, nor shall it be deemed incorporated by reference into any registration statement or other document pursuant to the Securities Act of 1933 or the Securities Exchange Act of 1934, except as expressly stated by specific reference in such filing.",
                "subsections": {}
              }
            }
          },
          "Section 9 - Financial Statements and Exhibits": {
            "ITEMS": {
              "Item 9.01 - Financial Statements and Exhibits": {
                "content": "Item 9.01 Financial Statements and Exhibits.",
                "subsections": {
                  "(d) Exhibits": "Exhibit Number: 99.1*, Description: Shareholder Letter dated November 1, 2023. Exhibit Number: 104, Description: Cover Page Interactive Data File (embedded within the Inline XBRL document). * This exhibit is intended to be furnished and shall not be deemed “filed” for purposes of the Securities and Exchange Act of 1934."
                }
              }
            }
          }
        }
      }
    },
    "2024": {
      "2024": {
        "FORM": "8-K",
        "CATEGORIES": {
          "Section 5 - Corporate Governance and Management": {
            "ITEMS": {
              "Item 5.02 - Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers": {
                "content": "On September 23, 2024, the Compensation Committee of the Board of Directors of Roku, Inc. (“Roku”) approved changes to the terms of Roku’s Executive Supplemental Stock Option Program (as amended, the “Amended Program”).",
                "subsections": {
                  "program_summary": "Pursuant to the Amended Program, employees at or above the level of Senior Vice President, including certain executive officers, other than Roku’s Chief Executive Officer (“Eligible Executives”), may elect on an annual basis to reduce their annual base salary for a given calendar year in exchange for a series of monthly grants of fully vested non-statutory stock options under Roku’s Amended and Restated 2017 Equity Incentive Plan (the “Plan”). The Amended Program will be effective commencing January 1, 2025, and will remain in effect until modified or revoked by the Board of Directors or the Compensation Committee.",
                  "enrollment_and_withdrawal": "An Eligible Executive may elect to participate in the Amended Program pursuant to an Executive Supplemental Stock Option Program Enrollment Form, which must be completed during the last open trading window in the calendar year immediately preceding the calendar year for which such election is made. An Eligible Executive may not change his or her annual election amount once the deadline for enrollment has passed. An Eligible Executive may not withdraw from the Amended Program, unless: (i) the withdrawal is during an open trading window, (ii) the Eligible Executive is not otherwise in possession of material, non-public information, and (iii) such withdrawal is due to an unforeseeable emergency. If an Eligible Executive withdraws, the Eligible Executive will not be able to re-enroll in the Amended Program for such calendar year, and must wait until the next enrollment period to enroll for the next calendar year.",
                  "option_grant_formula": "The number of stock options granted under the Amended Program on a monthly basis will be determined based on the following formula: (i) the monthly dollar amount by which the Eligible Executive has elected to reduce their annual base salary divided by (ii) (a) the closing price of our Class A common stock as reported by The Nasdaq Global Select Market on the date of grant (the “Fair Market Value”) divided by (b) a factor intended to result in such quotient approximating a Black-Scholes value (the “Stock Option Ratio”), with the Stock Option Ratio in effect during a given calendar year as determined by the Board of Directors or the Compensation Committee from time to time, rounded down to the nearest whole share. For example, if an Eligible Executive elects to reduce his or her annual base salary by $20,000 per month and the Fair Market Value is $50.00, then the Eligible Executive will be granted an option to purchase the number of shares of our Class A common stock equal to: (i) $20,000 divided by (ii) (a) $50.00 divided by (b) the Stock Option Ratio, rounded down to the nearest whole share. The Compensation Committee reserves the right and intends to review and may adjust the Stock Option Ratio on an annual basis, prior to the annual acceptance of Executive Supplemental Stock Option Program Enrollment Form.",
                  "grant_timing_and_terms": "Each monthly stock option grant will be made on the first trading day of the month (contingent upon the Eligible Executive’s continued service as of the grant date); provided, however, if such date occurs within the period starting four business days before and ending one business day after Roku (i) files a periodic report on a Form 10-K or a Form 10-Q or (ii) files or furnishes a current report on a Form 8-K that discloses material nonpublic information (including earnings information), other than a current report on Form 8-K disclosing a material new stock option grant award under Item 5.02(e) (such period, the “Filing Period”), then the grant date will be the first trading day following expiration of the Filing Period in the applicable month. Each stock option will be fully vested on the grant date and will have an exercise price equal to the Fair Market Value. The stock options will be subject to the terms and conditions of the Plan and will be administered on a non-discretionary basis without further action by the Compensation Committee. The stock options will be exercisable for up to ten years following the grant date regardless of the employment status of the Eligible Executive.",
                  "exhibit_reference": "The Executive Supplemental Stock Option Program Enrollment Form and the form of stock option grant notice and agreement substantially in the form of those to be used in connection with the Amended Program are filed as Exhibits 10.1 and 10.2, respectively, to this Current Report on Form 8-K and are incorporated herein by reference. The foregoing description does not purport to be complete and is qualified in its entirety by the terms of the exhibits."
                }
              }
            }
          },
          "Section 9 - Financial Statements and Exhibits": {
            "ITEMS": {
              "Item 9.01 - Financial Statements and Exhibits": {
                "content": "Financial Statements and Exhibits.",
                "subsections": {
                  "exhibits": "(d) Exhibits.\nExhibit Number    Description\n10.1              Executive Supplemental Stock Option Program Enrollment Form\n10.2              Forms of Consolidated Option Agreement and Option Grant Notice under 2017 Equity Incentive Plan (incorporated by reference to Exhibit 10.4 of Roku’s Annual Report on Form 10-K filed on February 18, 2022)\n104               Cover Page Interactive Data File (embedded within the Inline XBRL document)"
                }
              }
            }
          }
        }
      }
    },
    "2025": {
      "2024": {
        "FORM": "8-K",
        "CATEGORIES": {
          "Section 5 - Corporate Governance and Management": {
            "ITEMS": {
              "Item 5.02 - Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers": {
                "content": "On December 31, 2024, Roku, Inc. (the “Company”) and Gidon Katz, Senior Vice President, Platform Products & User Experience, agreed that Mr. Katz will leave the Company effective April 15, 2025.",
                "subsections": {
                  "severance_benefits": "Mr. Katz will receive severance benefits as contemplated by his Employment Contract with Roku DX UK Ltd, a wholly owned subsidiary of the Company.",
                  "employment_contract_reference": "Mr. Katz’s Employment Contract is attached as Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the U.S. Securities and Exchange Commission on August 11, 2023."
                }
              }
            }
          }
        }
      },
      "2025": {
        "FORM": "8-K",
        "CATEGORIES": {
          "Section 5 - Corporate Governance and Management": {
            "ITEMS": {
              "Item 5.07 - Submission of Matters to a Vote of Security Holders": {
                "content": "On June 11, 2025, Roku, Inc. (“Roku”) held its annual meeting of stockholders via a live webcast (the “Annual Meeting”). At the Annual Meeting, Roku’s stockholders voted on four proposals, each of which is described in more detail in Roku’s definitive proxy statement filed with the U.S. Securities and Exchange Commission on April 25, 2025 (the “2025 Proxy Statement”). The following is a brief description of each matter voted on and the certified results, including the number of votes cast for, against or withheld, as applicable, and the number of abstentions and broker non-votes, as applicable, with respect to each matter.",
                "subsections": {
                  "Proposal 1: Election of Directors": "The Class II director nominees were elected to serve until Roku’s 2028 annual meeting of stockholders and in each case until their successors are elected and qualified or until their earlier death, resignation or removal. The voting results were as follows:\n- Jeffrey Blackburn: Votes For 247,030,372, Votes Withheld 4,759,957, Broker Non-Votes 22,212,393, Percentage of Votes in Favor 98.1%\n- Gina Luna: Votes For 244,394,807, Votes Withheld 7,395,522, Broker Non-Votes 22,212,393, Percentage of Votes in Favor 97.1%\n- Ray Rothrock: Votes For 217,181,173, Votes Withheld 34,609,156, Broker Non-Votes 22,212,393, Percentage of Votes in Favor 86.3%",
                  "Proposal 2: Advisory Vote on Executive Compensation": "Stockholders approved, on an advisory basis, the compensation of Roku’s named executive officers, as described in the 2025 Proxy Statement. The voting results were as follows: Votes For 197,969,921, Votes Against 53,631,435, Abstentions 188,973, Broker Non-Votes 22,212,393, Percentage of Votes in Favor 78.6%",
                  "Proposal 3: Advisory Vote on Frequency of Executive Compensation Votes": "Stockholders approved, on an advisory basis, a frequency of future stockholder advisory votes on the compensation of Roku’s named executive officers of “one year.” The voting results were as follows: One Year 250,316,218, Two Years 130,761, Three Years 1,219,835, Abstentions 123,515, Broker Non-Votes 22,212,393, Percentage of Votes in Favor of One Year 99.4%",
                  "Proposal 4: Ratification of Independent Registered Accounting Firm": "Stockholders ratified the appointment of Deloitte & Touche LLP as Roku’s independent registered accounting firm for the fiscal year ending December 31, 2025. The voting results were as follows: Votes For 271,526,520, Votes Against 2,085,597, Abstentions 390,605, Percentage of Votes in Favor 99.1%"
                }
              }
            }
          }
        }
      }
    }
  }
}