{
  "NVIDIA CORPORATION": {
    "2020": {
      "2020": {
        "FORM": "8-K",
        "CATEGORIES": {
          "Section 1 - Registrant's Business and Operations": {
            "ITEMS": {
              "Item 1.01 - Entry into a Material Definitive Agreement": {
                "content": "On September 13, 2020, NVIDIA Corporation, a Delaware corporation (“NVIDIA”), entered into a Share Purchase Agreement (the “Purchase Agreement”) with NVIDIA International Holdings Inc., a Delaware corporation and a wholly owned subsidiary of NVIDIA (“NVIDIA Holdings”), Arm Limited, a company organized under the laws of England & Wales (“Arm”), SoftBank Group Capital Limited, a company organized under the laws of England & Wales (“SoftBank”), and SVF Holdco (UK) Limited, a company organized under the laws of England & Wales (“Vision Fund”, and together with SoftBank, the “Sellers”). The Purchase Agreement and the Share Purchase have been approved by the respective boards of directors or equivalent governing bodies of NVIDIA, NVIDIA Holdings, Arm and each of the Sellers.",
                "subsections": {
                  "Transaction Overview": "The Purchase Agreement provides that, upon the terms and subject to the conditions set forth in the Purchase Agreement, NVIDIA or its designee will acquire, from the Sellers, all of the allotted and issued ordinary shares of Arm of a par value of £0.001 (the “Share Purchase”) in a transaction valued at $40 billion. As consideration for the Share Purchase, NVIDIA will (i) pay the Sellers and Arm $2 billion in cash (the “Signing Consideration”) upon the signing of the Purchase Agreement as an advance on the consideration for the Share Purchase and as consideration for an intellectual property license from Arm to NVIDIA; (ii) pay the Sellers $10 billion in cash (subject to certain deductions and adjustments) at the closing of the Share Purchase (the “Closing”); (iii) issue to the Sellers 44.3 million shares of NVIDIA’s common stock, par value $0.001 (“NVIDIA Stock”), at the Closing with an aggregate value of $21.5 billion, as determined by the average daily closing price of NVIDIA Stock for the 30 trading days ending one trading day prior to the date of the Purchase Agreement; (iv) pay to the Sellers earn out payments of up to $5 billion in cash or up to 10.3 million shares of NVIDIA Stock (as determined by the average daily closing price of NVIDIA Stock for the 30 trading days ending one trading day prior to the date of the Purchase Agreement), contingent on the achievement of certain financial performance targets for Arm during the fiscal period beginning April 1, 2021 and ending March 31, 2022 and (v) issue restricted stock units covering NVIDIA Stock with an aggregate value not to exceed $1.5 billion to employees of Arm following the Closing, in each case in accordance with the terms of the Purchase Agreement.",
                  "Covenants, Representations and Warranties and Indemnities": "Each of NVIDIA, NVIDIA Holdings, Arm and the Sellers have made customary representations, warranties and covenants in the Purchase Agreement. Arm and the Sellers have made covenants, among others, relating to a reorganization and distribution of Arm’s IoT Services Group and certain other specified assets and liabilities and the conduct of Arm’s business in the ordinary course prior to the Closing. Each of NVIDIA, the Sellers and Arm have agreed in the Purchase Agreement to use their reasonable best efforts to obtain all required governmental and regulatory consents and approvals subject to certain limitations. In addition, the Purchase Agreement provides that, subject to certain negotiated limitations and survival periods, NVIDIA and the Sellers will indemnify each other for breaches of these representations, warranties and covenants and for certain other matters. At the Closing, NVIDIA and the Sellers will enter into an investor rights agreement, pursuant to which, among other things, the Sellers will be subject to certain rights and restrictions relating to the shares of NVIDIA Stock issued as consideration for the Share Purchase.",
                  "Conditions to the Share Purchase": "The Closing of the Share Purchase is subject to certain conditions, including, among others, (a) the absence of laws, orders, decrees, judgments and injunctions by any governmental entity of competent jurisdiction preventing the completion of the Share Purchase or that make the completion of the Share Purchase illegal, (b) the receipt of specified governmental and regulatory consents and approvals and expiration of any mandatory waiting period related thereto, (c) subject to certain exceptions, the accuracy of representations and warranties with respect to Arm, NVIDIA, NVIDIA Holdings and the Sellers, (d) compliance in all material respects by Arm, NVIDIA, NVIDIA Holdings and the Sellers with their respective covenants contained in the Purchase Agreement, (e) the implementation by Arm of the reorganizations described above, and (f) certification by Arm and the Sellers of Arm’s compliance with certain undertakings given by Arm to The Panel on Takeovers and Mergers of the United Kingdom. The Share Purchase is not subject to a financing condition.",
                  "Termination Rights": "The Purchase Agreement contains certain termination rights by either NVIDIA or the Sellers, including if the Share Purchase is not consummated by September 13, 2021, which date may be extended by three months on four consecutive occasions if, on the applicable date, certain conditions to Closing have not been satisfied. If the Purchase Agreement is terminated under certain circumstances, the Sellers will refund a portion of the Signing Consideration to NVIDIA.",
                  "Disclaimer on Agreement Terms": "The foregoing description of the Purchase Agreement is qualified in its entirety by reference to the full text of the Purchase Agreement, a copy of which is filed as Exhibit 2.1 hereto. The Purchase Agreement contains representations, warranties and covenants that the respective parties made to each other as of the date of such agreement or other specific dates. The assertions embodied in those representations, warranties and covenants were made for purposes of the contract among the respective parties and are subject to important qualifications and limitations agreed to by the parties in connection with negotiating such agreement. The Purchase Agreement has been attached to provide investors with information regarding its terms. It is not intended to provide any other factual information about NVIDIA, NVIDIA Holdings, Arm or the Sellers. Investors should not rely on the representations, warranties, covenants and agreements, or any descriptions thereof, as characterizations of the actual state of facts or condition of any party to the Purchase Agreement. Information concerning the subject matter of the representations and warranties and other terms may change after the date of the Purchase Agreement, which subsequent information may or may not be fully reflected in NVIDIA’s public disclosures."
                }
              }
            }
          },
          "Section 7 - Regulation FD": {
            "ITEMS": {
              "Item 7.01 - Regulation FD Disclosure": {
                "content": "On September 13, 2020, NVIDIA, SoftBank and Arm issued a joint press release related to their entry into the Purchase Agreement, a copy of which is furnished as Exhibit 99.1. On September 13, 2020, NVIDIA published an investor presentation regarding the transaction, a copy of which is furnished as Exhibit 99.2. The information in this Item 7.01 and Exhibits 99.1 and 99.2 are furnished and shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, or subject to the liabilities of that Section or Sections 11 and 12(a)(2) of the Securities Act of 1933, as amended. The information in this Current Report shall not be incorporated by reference in any filing with the SEC made by NVIDIA, whether made before or after the date hereof, regardless of any general incorporation language in such filing.",
                "subsections": {
                  "Safe Harbor for Forward-looking Statements": "All statements included or incorporated by reference in this communication, other than statements or characterizations of historical fact, are forward-looking statements. These can often be identified by words such as “anticipates,” “expects,” “intends,” “plans,” “believes,” “seeks,” “estimates,” “may,” “will,” “should,” or similar expressions. Statements as to the proposed Share Purchase, including benefits of the transaction, timing, price, and closing conditions, are forward-looking statements subject to risks and uncertainties. Many factors could cause actual future events to differ materially, including: the risk that the transaction may not be completed in a timely manner or at all; uncertainties as to the timing and satisfaction of conditions, including regulatory approvals; the potential for regulatory authorities to require divestitures or other concessions; the occurrence of any event that could give rise to the termination of the Purchase Agreement; the effect of the announcement on business relationships and operating results; delays or increased costs in integrating Arm’s technology; failure to realize expected financial benefits and synergies; challenges and expenses associated with integration; litigation or regulatory restrictions; unanticipated restructuring costs or undisclosed liabilities; failure to retain key personnel and customers; risks related to diverting management’s attention; lack of third-party support for the combined company’s products; negative actions by competitors; adverse reactions to business relationships; the effects of the COVID-19 pandemic; negative changes in general economic conditions; and other risks described in NVIDIA’s filings with the SEC on Forms 10-K, 10-Q, and 8-K. These forward-looking statements are not guarantees of future performance and speak only as of the date hereof, and, except as required by law, NVIDIA disclaims any obligation to update them."
                }
              }
            }
          },
          "Section 9 - Financial Statements and Exhibits": {
            "ITEMS": {
              "Item 9.01 - Financial Statements and Exhibits": {
                "content": "This section lists the exhibits included with this Current Report on Form 8-K.",
                "subsections": {
                  "(d) Exhibits": "Exhibit Number 2.1: Share Purchase Agreement, dated September 13, 2020, by and among NVIDIA, NVIDIA Holdings, Arm, SoftBank, and Vision Fund*\nExhibit Number 99.1: Joint Press Release of NVIDIA, SoftBank and Arm, dated September 13, 2020\nExhibit Number 99.2: Investor Presentation, dated September 13, 2020\nExhibit Number 104: The cover page of this Current Report on Form 8-K, formatted in inline XBRL (included as Exhibit 101)\n*Certain exhibits and schedules have been omitted in accordance with Regulation S-K Item 601(a)(5). NVIDIA agrees to supplementally furnish to the SEC a copy of any omitted exhibits or schedules upon request of the SEC."
                }
              }
            }
          }
        }
      }
    },
    "2021": {
      "2021": {
        "FORM": "8-K",
        "CATEGORIES": {
          "Section 1 - Registrant's Business and Operations": {
            "ITEMS": {
              "Item 1.01 - Entry into a Material Definitive Agreement": {
                "content": "On June 14, 2021, NVIDIA Corporation entered into an underwriting agreement to issue and sell $5.0 billion aggregate principal amount of unsecured notes. The terms of the Notes are governed by an indenture dated September 16, 2016, as supplemented by an Officers’ Certificate dated June 16, 2021.",
                "subsections": {
                  "Underwriting Agreement": "On June 14, 2021, the Company entered into an Underwriting Agreement with Morgan Stanley & Co. LLC, as representative of the underwriters, to issue and sell $5.0 billion aggregate principal amount of unsecured notes, consisting of: $1.25 billion of 0.309% notes due 2023 (the 2023 Notes), $1.25 billion of 0.584% notes due 2024 (the 2024 Notes), $1.25 billion of 1.550% notes due 2028 (the 2028 Notes), and $1.25 billion of 2.000% notes due 2031 (the 2031 Notes). The Underwriting Agreement includes customary representations, warranties, conditions, covenants, and an agreement to indemnify the Underwriters. The net proceeds from the offering were approximately $4.98 billion, after deducting underwriting discounts and estimated offering expenses. The Company intends to use the net proceeds for general corporate purposes, which may include repayment of indebtedness. The offering was made pursuant to the Company’s Registration Statement on Form S-3 (File No. 333-237390).",
                  "Indenture": "The terms of the Notes are governed by an indenture, dated September 16, 2016 (the Base Indenture), between the Company and Wells Fargo Bank, National Association (the Trustee), as supplemented by an Officers’ Certificate, dated as of June 16, 2021. The 2023 Notes will mature on June 15, 2023, the 2024 Notes on June 14, 2024, the 2028 Notes on June 15, 2028, and the 2031 Notes on June 15, 2031. Interest on the 2024 Notes is payable on June 14 and December 14 of each year, beginning December 14, 2021. Interest on all other series is payable on June 15 and December 15 of each year, beginning December 15, 2021. The Company may redeem the Notes prior to maturity at redemption prices that include a make-whole premium, with certain exceptions. The Indenture includes covenants limiting the Company’s ability to create liens, enter into sale and leaseback transactions, or merge or sell all assets, subject to exceptions. In the event of a change of control and a credit downgrade, the Company will be required to offer to repurchase the Notes at 101% of the principal amount plus accrued interest. The Notes are the Company’s unsecured senior obligations.",
                  "Disclaimer on Agreements": "The agreements included as exhibits are to provide information regarding their terms and are not intended to provide other factual disclosure. They may contain representations and warranties made for the benefit of the parties to the agreement, may be qualified by non-public disclosures, may apply different standards of materiality, and were made only as of the specified date. They may not describe the actual state of affairs at any time."
                }
              }
            }
          },
          "Section 2 - Financial Information": {
            "ITEMS": {
              "Item 2.03 - Creation of a Direct Financial Obligation or an Obligation under an Off-Balance Sheet Arrangement of a Registrant": {
                "content": "The information set forth in Item 1.01 above is hereby incorporated by reference into this Item 2.03, insofar as it relates to the creation of a direct financial obligation.",
                "subsections": {}
              }
            }
          },
          "Section 9 - Financial Statements and Exhibits": {
            "ITEMS": {
              "Item 9.01 - Financial Statements and Exhibits": {
                "content": "List of exhibits filed with this Current Report on Form 8-K.",
                "subsections": {
                  "Exhibits": "1.1 - Underwriting Agreement, dated as of June 14, 2021, by and among the Company and Morgan Stanley & Co. LLC, as representative of the several underwriters.\n4.1 - Indenture, dated as of September 16, 2016, by and between the Company and Wells Fargo Bank, National Association, as Trustee (filed as Exhibit 4.1 to NVIDIA Corporation’s Current Report on Form 8-K filed on September 16, 2016 (File No. 000-23985), and incorporated by reference herein).\n4.2 - Officers’ Certificate, dated as of June 16, 2021.\n4.3 - Form of 2023 Note (included in Exhibit 4.2).\n4.4 - Form of 2024 Note (included in Exhibit 4.2).\n4.5 - Form of 2028 Note (included in Exhibit 4.2).\n4.6 - Form of 2031 Note (included in Exhibit 4.2).\n5.1 - Opinion of Cooley LLP regarding the validity of the Notes.\n23.1 - Consent of Cooley LLP (included in Exhibit 5.1).\n104 - Cover Page Interactive Data File (embedded within the Inline XBRL document)."
                }
              }
            }
          }
        }
      }
    },
    "2022": {
      "2022": {
        "FORM": "8-K",
        "CATEGORIES": {
          "Section 2 - Financial Information": {
            "ITEMS": {
              "Item 2.02 - Results of Operations and Financial Condition": {
                "content": "On November 16, 2022, NVIDIA Corporation, or the Company, issued a press release announcing its results for the quarter ended October 30, 2022. The press release is attached as Exhibit 99.1 and is incorporated herein by reference. Attached hereto as Exhibit 99.2 and incorporated by reference herein is financial information and commentary by Colette M. Kress, Executive Vice President and Chief Financial Officer of the Company, regarding results of the quarter ended October 30, 2022, or the CFO Commentary. The CFO Commentary will be posted to http://investor.nvidia.com immediately after the filing of this Current Report. The press release and CFO Commentary are furnished and shall not be deemed \"filed\" for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, or subject to the liabilities of that Section or Sections 11 and 12(a)(2) of the Securities Act of 1933, as amended. The information in this Current Report shall not be incorporated by reference in any filing with the U.S. Securities and Exchange Commission made by the Company, whether made before or after the date hereof, regardless of any general incorporation language in such filing.",
                "subsections": {
                  "announcement_details": "On November 16, 2022, NVIDIA Corporation issued a press release (Exhibit 99.1) and financial commentary by the CFO (Exhibit 99.2) announcing its results for the quarter ended October 30, 2022.",
                  "legal_disclaimer": "The press release and CFO Commentary are furnished and shall not be deemed \"filed\" for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, or subject to the liabilities of that Section or Sections 11 and 12(a)(2) of the Securities Act of 1933, as amended. The information shall not be incorporated by reference in any filing with the U.S. Securities and Exchange Commission."
                }
              }
            }
          },
          "Section 9 - Financial Statements and Exhibits": {
            "ITEMS": {
              "Item 9.01 - Financial Statements and Exhibits": {
                "content": "(d) Exhibits",
                "subsections": {
                  "exhibits_list": "Exhibit 99.1: Press Release, dated November 16, 2022, entitled \"NVIDIA Announces Financial Results for Third Quarter Fiscal 2023\".\nExhibit 99.2: CFO Commentary on Third Quarter Fiscal 2023 Results.\nExhibit 104: The cover page of this Current Report on Form 8-K, formatted in inline XBRL (included as Exhibit 101)."
                }
              }
            }
          }
        }
      }
    },
    "2023": {
      "2023": {
        "FORM": "8-K",
        "CATEGORIES": {
          "Section 2 - Financial Information": {
            "ITEMS": {
              "Item 2.02 - Results of Operations and Financial Condition": {
                "content": "On November 21, 2023, NVIDIA Corporation, or the Company, issued a press release announcing its results for the quarter ended October 29, 2023. The press release is attached as Exhibit 99.1 and is incorporated herein by reference. Attached hereto as Exhibit 99.2 and incorporated by reference herein is financial information and commentary by Colette M. Kress, Executive Vice President and Chief Financial Officer of the Company, regarding results of the quarter ended October 29, 2023, or the CFO Commentary. The CFO Commentary will be posted to http://investor.nvidia.com immediately after the filing of this Current Report.",
                "subsections": {
                  "filing_status": "The press release and CFO Commentary are furnished and shall not be deemed \"filed\" for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, or subject to the liabilities of that Section or Sections 11 and 12(a)(2) of the Securities Act of 1933, as amended. The information in this Current Report shall not be incorporated by reference in any filing with the U.S. Securities and Exchange Commission made by the Company, whether made before or after the date hereof, regardless of any general incorporation language in such filing."
                }
              }
            }
          },
          "Section 9 - Financial Statements and Exhibits": {
            "ITEMS": {
              "Item 9.01 - Financial Statements and Exhibits": {
                "content": "(d) Exhibits",
                "subsections": {
                  "exhibits_list": "Exhibit 99.1: Press Release, dated November 21, 2023, entitled \"NVIDIA Announces Financial Results for Third Quarter Fiscal 2024\".\nExhibit 99.2: CFO Commentary on Third Quarter Fiscal 2024 Results.\nExhibit 104: The cover page of this Current Report on Form 8-K, formatted in inline XBRL (included as Exhibit 101)."
                }
              }
            }
          }
        }
      }
    },
    "2024": {
      "2024": {
        "FORM": "8-K",
        "CATEGORIES": {
          "Section 2 - Financial Information": {
            "ITEMS": {
              "Item 2.02 - Results of Operations and Financial Condition": {
                "content": "On November 20, 2024, NVIDIA Corporation, or the Company, issued a press release announcing its results for the quarter ended October 27, 2024. The press release is attached as Exhibit 99.1 and is incorporated herein by reference. Attached hereto as Exhibit 99.2 and incorporated by reference herein is financial information and commentary by Colette M. Kress, Executive Vice President and Chief Financial Officer of the Company, regarding results for the quarter ended October 27, 2024, or the CFO Commentary. The CFO Commentary will be posted to https://investor.nvidia.com immediately after the filing of this Current Report. The press release and CFO Commentary are furnished and shall not be deemed \"filed\" for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, or subject to the liabilities of that Section or Sections 11 and 12(a)(2) of the Securities Act of 1933, as amended. The information in this Current Report shall not be incorporated by reference in any filing with the U.S. Securities and Exchange Commission made by the Company, whether made before or after the date hereof, regardless of any general incorporation language in such filing.",
                "subsections": {
                  "announcement_details": "On November 20, 2024, NVIDIA Corporation, or the Company, issued a press release announcing its results for the quarter ended October 27, 2024. The press release is attached as Exhibit 99.1 and is incorporated herein by reference.",
                  "cfo_commentary": "Attached hereto as Exhibit 99.2 and incorporated by reference herein is financial information and commentary by Colette M. Kress, Executive Vice President and Chief Financial Officer of the Company, regarding results for the quarter ended October 27, 2024, or the CFO Commentary. The CFO Commentary will be posted to https://investor.nvidia.com immediately after the filing of this Current Report.",
                  "filing_status": "The press release and CFO Commentary are furnished and shall not be deemed \"filed\" for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, or subject to the liabilities of that Section or Sections 11 and 12(a)(2) of the Securities Act of 1933, as amended. The information in this Current Report shall not be incorporated by reference in any filing with the U.S. Securities and Exchange Commission made by the Company, whether made before or after the date hereof, regardless of any general incorporation language in such filing."
                }
              }
            }
          },
          "Section 9 - Financial Statements and Exhibits": {
            "ITEMS": {
              "Item 9.01 - Financial Statements and Exhibits": {
                "content": "(d) Exhibits",
                "subsections": {
                  "exhibit_99.1": "Press Release, dated November 20, 2024, entitled \"NVIDIA Announces Financial Results for Third Quarter Fiscal 2025\"",
                  "exhibit_99.2": "CFO Commentary on Third Quarter Fiscal 2025 Results",
                  "exhibit_104": "The cover page of this Current Report on Form 8-K, formatted in inline XBRL (included as Exhibit 101)"
                }
              }
            }
          }
        }
      }
    },
    "2025": {
      "2025": {
        "FORM": "8-K",
        "CATEGORIES": {
          "Section 5 - Corporate Governance and Management": {
            "ITEMS": {
              "Item 5.02 - Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers": {
                "content": "(b) On July 31, 2025, Ellen Ochoa resigned from the Board of Directors, or the Board, of NVIDIA Corporation, or the Company, including as a member of the Nominating and Corporate Governance Committee of the Board, effective immediately. Dr. Ochoa’s resignation is for personal reasons and not because of any disagreement with the Company on any matter relating to the Company’s operations, policies or practices.",
                "subsections": {}
              }
            }
          }
        }
      }
    }
  }
}